{
  "projects": [
    {
      "id": 1,
      "title": "Crash Landing",
      "images": {
        "vector": "./media/crash-landing-logo-2-exploded.svg",
        "raster": "https://raw.githubusercontent.com/fitzgeraldkd/summer-code-jam-2020/master/mysterious-mice/spacebook-logo-light.png"
      },
      "technologies": [
        "JavaScript",
        "TypeScript",
        "jQuery"
      ],
      "description": "A simple text-based browser game where you help a rover navigate the surface of Mars to find its power supply that was lost in a crash landing. This was originally developed as part of the Spacebook project built for the Python Discord Summer Code Jam 2020. I rebuilt it with to develop familiarity with TypeScript and to make this project accessible from a static web page.",
      "links": {
        "GitHub": "#",
        "Demo": "#"
      }
    },
    {
      "id": 2,
      "title": "Spacebook",
      "images": {
        "vector": "./media/spacebook-logo-stacked-light-exploded.svg",
        "raster": "https://raw.githubusercontent.com/fitzgeraldkd/summer-code-jam-2020/master/mysterious-mice/spacebook-logo-light.png"
      },
      "technologies": [
        "Python",
        "Django"
      ],
      "description": "This was developed for the Python Discord Summer Code Jam 2020, where I worked with a team of 4 to develop a web app in Django based on the theme \"Early Internet.\" My team decided to build a social media website for the Mars rovers. Photos taken by the rovers were downloaded using API from NASA and were added as posts to each of the rovers' profiles. We also added a text-based game where you play as a rover that just crash landed on Mars. The goal of the game is to find your plutonium before your battery depletes. Out of the 45 teams that submitted projects, we finished in third place. The files for our project can be downloaded at the GitHub page, and instructions to set up and launch the site are included in the ReadMe.",
      "links": {
        "GitHub": "#"
      }
    },
    {
      "id": 3,
      "title": "TomautoMate",
      "images": {
        "vector": "https://raw.githubusercontent.com/fitzgeraldkd/TomautoMate/main/icons/tomautomate.svg"
      },
      "technologies": [
        "JavaScript"
      ],
      "description": "",
      "links": {
        "GitHub": "#"
      }
    }
  ]
}